from udapi.core.block import Block
import logging

nums = ['εἷς', 'δύο', 'τρεῖς', 'τέσσαρες', 'πέντε' , 'ἕξ', 'ἑπτά', 'ὀκτώ', 'ἐννέα',
   'δέκα', 'ἕνδεκα', 'δώδεκα', 'πεντεκαίδεκα', 'ἑκκαίδεκα', 'ἑπτακαίδεκα', 'ὀκτωκαίδεκα',
   'ἐννεακαίδεκα', 'εἴκοσι', 'τριάκοντα', 'τετταράκοντα', 'πεντήκοντα', 'ἑξήκοντα', 
   'ἑβδομήκοντα', 'ὀγδοήκοντα', 'ἐνενήκοντα', 'ἑκατόν', 'διακόσιοι', 'τριακόσιοι',
   'τετρακόσιοι', 'πεντακόσιοι', 'ἑξακόσιοι', 'ἑπτακόσιοι', 'ὀκτακόσιοι', 'ἐνακόσιοι',
   'χίλιοι', 'δισχίλιοι', 'τρισχίλιοι', 'μύριοι', 'δισμύριοι', 'δεκακισμύριοι']
   
   
class FixNumerals(Block):
    def process_node(self, node):
        if node.lemma in nums and node.xpos != 'm':
            node.xpos = f'm{node.xpos[1:]}'
            logging.info(f'Node {node.address()} ({node.form}) set to numeral!') 
        
